import http from "./http-common";
import qs from "qs";
import i18n from "i18next";

// Article APIs
export default new (class ArticleService {
  // Get all articles
  async getArticles(pageSize) {
    // return [
    //   {
    //     id: 1,
    //     attributes: {
    //       slug: "ezq",
    //       title:
    //         "EZQ: เว็บแอปพลิเคชันเพื่อการเรียนการสอนควอนตัมคอมพิวเตอร์สำหรับผู้สอนและผู้เรียน",
    //       description:
    //         "EZQ คือเว็บแอปพลิเคชันที่ถูกสร้างขึ้นโดยมีจุดมุ่งหมายเพื่อยกระดับประสบการณ์การเรียนรู้ด้านควอนตัมคอมพิวเตอร์สำหรับผู้เริ่มศึกษา ภายในเว็บแอปพลิเคชันประกอบด้วยฟีเจอร์ Code Playground ซึ่งทั้งผู้เรียนและผู้สอน",
    //       cover: {
    //         data: {
    //           id: 17,
    //           attributes: {
    //             url: "/uploads/1656253109941_be7230fd75.jpg",
    //           },
    //         },
    //       },
    //       tags: {
    //         data: [
    //           {
    //             id: 2,
    //             attributes: {
    //               name: "QuantumProgramming",
    //             },
    //           },
    //           {
    //             id: 13,
    //             attributes: {
    //               name: "QuantumIDE",
    //             },
    //           },
    //           {
    //             id: 14,
    //             attributes: {
    //               name: "EducationalProgram",
    //             },
    //           },
    //           {
    //             id: 15,
    //             attributes: {
    //               name: "LearningAndTeachingProgram",
    //             },
    //           },
    //           {
    //             id: 17,
    //             attributes: {
    //               name: "QuantumLearning",
    //             },
    //           },
    //           {
    //             id: 16,
    //             attributes: {
    //               name: "InteractiveLearning",
    //             },
    //           },
    //         ],
    //       },
    //     },
    //   },
    //   {
    //     id: 1,
    //     attributes: {
    //       slug: "ezq",
    //       title:
    //         "EZQ: เว็บแอปพลิเคชันเพื่อการเรียนการสอนควอนตัมคอมพิวเตอร์สำหรับผู้สอนและผู้เรียน",
    //       description:
    //         "EZQ คือเว็บแอปพลิเคชันที่ถูกสร้างขึ้นโดยมีจุดมุ่งหมายเพื่อยกระดับประสบการณ์การเรียนรู้ด้านควอนตัมคอมพิวเตอร์สำหรับผู้เริ่มศึกษา ภายในเว็บแอปพลิเคชันประกอบด้วยฟีเจอร์ Code Playground ซึ่งทั้งผู้เรียนและผู้สอน",
    //       cover: {
    //         data: {
    //           id: 17,
    //           attributes: {
    //             url: "/uploads/1656253109941_be7230fd75.jpg",
    //           },
    //         },
    //       },
    //       tags: {
    //         data: [
    //           {
    //             id: 2,
    //             attributes: {
    //               name: "QuantumProgramming",
    //             },
    //           },
    //           {
    //             id: 13,
    //             attributes: {
    //               name: "QuantumIDE",
    //             },
    //           },
    //           {
    //             id: 14,
    //             attributes: {
    //               name: "EducationalProgram",
    //             },
    //           },
    //           {
    //             id: 15,
    //             attributes: {
    //               name: "LearningAndTeachingProgram",
    //             },
    //           },
    //           {
    //             id: 17,
    //             attributes: {
    //               name: "QuantumLearning",
    //             },
    //           },
    //           {
    //             id: 16,
    //             attributes: {
    //               name: "InteractiveLearning",
    //             },
    //           },
    //         ],
    //       },
    //     },
    //   },
    //   {
    //     id: 2,
    //     attributes: {
    //       slug: "ezq",
    //       title:
    //         "EZQ: เว็บแอปพลิเคชันเพื่อการเรียนการสอนควอนตัมคอมพิวเตอร์สำหรับผู้สอนและผู้เรียน",
    //       description:
    //         "EZQ คือเว็บแอปพลิเคชันที่ถูกสร้างขึ้นโดยมีจุดมุ่งหมายเพื่อยกระดับประสบการณ์การเรียนรู้ด้านควอนตัมคอมพิวเตอร์สำหรับผู้เริ่มศึกษา ภายในเว็บแอปพลิเคชันประกอบด้วยฟีเจอร์ Code Playground ซึ่งทั้งผู้เรียนและผู้สอน",
    //       cover: {
    //         data: {
    //           id: 17,
    //           attributes: {
    //             url: "/uploads/1656253109941_be7230fd75.jpg",
    //           },
    //         },
    //       },
    //       tags: {
    //         data: [
    //           {
    //             id: 2,
    //             attributes: {
    //               name: "QuantumProgramming",
    //             },
    //           },
    //           {
    //             id: 13,
    //             attributes: {
    //               name: "QuantumIDE",
    //             },
    //           },
    //           {
    //             id: 14,
    //             attributes: {
    //               name: "EducationalProgram",
    //             },
    //           },
    //           {
    //             id: 15,
    //             attributes: {
    //               name: "LearningAndTeachingProgram",
    //             },
    //           },
    //           {
    //             id: 17,
    //             attributes: {
    //               name: "QuantumLearning",
    //             },
    //           },
    //           {
    //             id: 16,
    //             attributes: {
    //               name: "InteractiveLearning",
    //             },
    //           },
    //         ],
    //       },
    //     },
    //   },
    //   {
    //     id: 3,
    //     attributes: {
    //       slug: "ezq",
    //       title:
    //         "EZQ: เว็บแอปพลิเคชันเพื่อการเรียนการสอนควอนตัมคอมพิวเตอร์สำหรับผู้สอนและผู้เรียน",
    //       description:
    //         "EZQ คือเว็บแอปพลิเคชันที่ถูกสร้างขึ้นโดยมีจุดมุ่งหมายเพื่อยกระดับประสบการณ์การเรียนรู้ด้านควอนตัมคอมพิวเตอร์สำหรับผู้เริ่มศึกษา ภายในเว็บแอปพลิเคชันประกอบด้วยฟีเจอร์ Code Playground ซึ่งทั้งผู้เรียนและผู้สอน",
    //       cover: {
    //         data: {
    //           id: 17,
    //           attributes: {
    //             url: "/uploads/1656253109941_be7230fd75.jpg",
    //           },
    //         },
    //       },
    //       tags: {
    //         data: [
    //           {
    //             id: 2,
    //             attributes: {
    //               name: "QuantumProgramming",
    //             },
    //           },
    //           {
    //             id: 13,
    //             attributes: {
    //               name: "QuantumIDE",
    //             },
    //           },
    //           {
    //             id: 14,
    //             attributes: {
    //               name: "EducationalProgram",
    //             },
    //           },
    //           {
    //             id: 15,
    //             attributes: {
    //               name: "LearningAndTeachingProgram",
    //             },
    //           },
    //           {
    //             id: 17,
    //             attributes: {
    //               name: "QuantumLearning",
    //             },
    //           },
    //           {
    //             id: 16,
    //             attributes: {
    //               name: "InteractiveLearning",
    //             },
    //           },
    //         ],
    //       },
    //     },
    //   },
    //   {
    //     id: 4,
    //     attributes: {
    //       slug: "ezq",
    //       title:
    //         "EZQ: เว็บแอปพลิเคชันเพื่อการเรียนการสอนควอนตัมคอมพิวเตอร์สำหรับผู้สอนและผู้เรียน",
    //       description:
    //         "EZQ คือเว็บแอปพลิเคชันที่ถูกสร้างขึ้นโดยมีจุดมุ่งหมายเพื่อยกระดับประสบการณ์การเรียนรู้ด้านควอนตัมคอมพิวเตอร์สำหรับผู้เริ่มศึกษา ภายในเว็บแอปพลิเคชันประกอบด้วยฟีเจอร์ Code Playground ซึ่งทั้งผู้เรียนและผู้สอน",
    //       cover: {
    //         data: {
    //           id: 17,
    //           attributes: {
    //             url: "/uploads/1656253109941_be7230fd75.jpg",
    //           },
    //         },
    //       },
    //       tags: {
    //         data: [
    //           {
    //             id: 2,
    //             attributes: {
    //               name: "QuantumProgramming",
    //             },
    //           },
    //           {
    //             id: 13,
    //             attributes: {
    //               name: "QuantumIDE",
    //             },
    //           },
    //           {
    //             id: 14,
    //             attributes: {
    //               name: "EducationalProgram",
    //             },
    //           },
    //           {
    //             id: 15,
    //             attributes: {
    //               name: "LearningAndTeachingProgram",
    //             },
    //           },
    //           {
    //             id: 17,
    //             attributes: {
    //               name: "QuantumLearning",
    //             },
    //           },
    //           {
    //             id: 16,
    //             attributes: {
    //               name: "InteractiveLearning",
    //             },
    //           },
    //         ],
    //       },
    //     },
    //   },
    // ];
    const query = qs.stringify(
      {
        fields: ["slug", "title", "description"],
        populate: {
          cover: {
            fields: ["url"],
          },
          tags: {
            fields: ["name"],
          },
        },
        locale: i18n.language,
        pagination: {
          page: 1,
          pageSize: pageSize,
        },
      },
      {
        encodeValuesOnly: true,
      }
    );

    return await http
      .get("/articles?" + query)
      .then((response) => {
        return response.data.data;
      })
      .catch((error) => {
        console.log(error);
      });
  }

  // Get article by slug
  async getArticleBySlug(slug) {
    // return {
    //   id: 1,
    //   attributes: {
    //     slug: "ezq",
    //     title:
    //       "EZQ: เว็บแอปพลิเคชันเพื่อการเรียนการสอนควอนตัมคอมพิวเตอร์สำหรับผู้สอนและผู้เรียน",
    //     description:
    //       "EZQ คือเว็บแอปพลิเคชันที่ถูกสร้างขึ้นโดยมีจุดมุ่งหมายเพื่อยกระดับประสบการณ์การเรียนรู้ด้านควอนตัมคอมพิวเตอร์สำหรับผู้เริ่มศึกษา ภายในเว็บแอปพลิเคชันประกอบด้วยฟีเจอร์ Code Playground ซึ่งทั้งผู้เรียนและผู้สอน",
    //     createdAt: "2022-06-26T14:19:30.770Z",
    //     updatedAt: "2022-06-26T14:21:41.033Z",
    //     publishedAt: "2022-06-26T14:19:32.166Z",
    //     locale: "th",
    //     content:
    //       '<p><span style="background-color:transparent;color:#000000;">EZQ คือเว็บแอปพลิเคชันที่ถูกสร้างขึ้นโดยมีจุดมุ่งหมายเพื่อยกระดับประสบการณ์การเรียนรู้ด้านควอนตัมคอมพิวเตอร์สำหรับผู้เริ่มศึกษา ภายในเว็บแอปพลิเคชันประกอบด้วยฟีเจอร์ Code Playground ซึ่งทั้งผู้เรียนและผู้สอน รวมถึงผู้ใช้งานที่ยังไม่ได้ลงทะเบียนสามารถเข้าใช้งานและสร้างวงจรของตนเองผ่าน UI แบบกราฟิก อีกทั้งยังสามารถเขียนโค้ดผ่าน Code editor ซึ่งใช้งานผ่าน Python Library ของซอฟต์แวร์ตัวกลาง Qiskit หากผู้สอนหรือผู้เรียนเกิดข้อสงสัยหรือต้องการพูดคุยแลกเปลี่ยนความคิดเห็นต่าง ๆ ที่เกี่ยวข้องกับควอนตัมคอมพิวเตอร์ ผู้ใช้งานที่ได้ทำการลงทะเบียนแล้วสามารถตั้งกระทู้และแสดงความเห็นผ่านฟีเจอร์ห้องสนทนาได้ทั้งในรูปแบบของตัวอักษรและรูปภาพ ในส่วนของผู้สอนนั้น จะมีฟีเจอร์ที่สามารถสร้างบทเรียนและแบบฝึกหัดเกี่ยวกับควอนตัมคอมพิวเตอร์ได้ โดยผู้สอนจะสามารถเพิ่มเนื้อหาบทเรียนผ่านแบบฟอร์มของทางเว็บแอปพลิเคชันได้ในรูปแบบตัวอักษรและรูปภาพเช่นเดียวกับฟีเจอร์ห้องสนทนา อีกทั้งยังสามารถสร้างแบบฝึกหัดพร้อมกับเพิ่มวิธีตรวจอัตโนมัติได้อีกด้วย ซึ่งผู้เรียนสามารถเลือกศึกษาบทเรียนต่าง ๆ ที่ผู้สอนได้ทำการเผยแพร่ตามความสนใจของตนเอง</span></p><p>&nbsp;</p><p><span style="background-color:transparent;color:#000000;">EZQ คือเว็บแอปพลิเคชันที่ถูกสร้างขึ้นโดยมีจุดมุ่งหมายเพื่อยกระดับประสบการณ์การเรียนรู้ด้านควอนตัมคอมพิวเตอร์สำหรับผู้เริ่มศึกษา ภายในเว็บแอปพลิเคชันประกอบด้วยฟีเจอร์ Code Playground ซึ่งทั้งผู้เรียนและผู้สอน รวมถึงผู้ใช้งานที่ยังไม่ได้ลงทะเบียนสามารถเข้าใช้งานและสร้างวงจรของตนเองผ่าน UI แบบกราฟิก อีกทั้งยังสามารถเขียนโค้ดผ่าน Code editor ซึ่งใช้งานผ่าน Python Library ของซอฟต์แวร์ตัวกลาง Qiskit หากผู้สอนหรือผู้เรียนเกิดข้อสงสัยหรือต้องการพูดคุยแลกเปลี่ยนความคิดเห็นต่าง ๆ ที่เกี่ยวข้องกับควอนตัมคอมพิวเตอร์ ผู้ใช้งานที่ได้ทำการลงทะเบียนแล้วสามารถตั้งกระทู้และแสดงความเห็นผ่านฟีเจอร์ห้องสนทนาได้ทั้งในรูปแบบของตัวอักษรและรูปภาพ ในส่วนของผู้สอนนั้น จะมีฟีเจอร์ที่สามารถสร้างบทเรียนและแบบฝึกหัดเกี่ยวกับควอนตัมคอมพิวเตอร์ได้ โดยผู้สอนจะสามารถเพิ่มเนื้อหาบทเรียนผ่านแบบฟอร์มของทางเว็บแอปพลิเคชันได้ในรูปแบบตัวอักษรและรูปภาพเช่นเดียวกับฟีเจอร์ห้องสนทนา อีกทั้งยังสามารถสร้างแบบฝึกหัดพร้อมกับเพิ่มวิธีตรวจอัตโนมัติได้อีกด้วย ซึ่งผู้เรียนสามารถเลือกศึกษาบทเรียนต่าง ๆ ที่ผู้สอนได้ทำการเผยแพร่ตามความสนใจของตนเอง</span></p><p>&nbsp;</p><p><span style="background-color:transparent;color:#000000;">EZQ คือเว็บแอปพลิเคชันที่ถูกสร้างขึ้นโดยมีจุดมุ่งหมายเพื่อยกระดับประสบการณ์การเรียนรู้ด้านควอนตัมคอมพิวเตอร์สำหรับผู้เริ่มศึกษา ภายในเว็บแอปพลิเคชันประกอบด้วยฟีเจอร์ Code Playground ซึ่งทั้งผู้เรียนและผู้สอน รวมถึงผู้ใช้งานที่ยังไม่ได้ลงทะเบียนสามารถเข้าใช้งานและสร้างวงจรของตนเองผ่าน UI แบบกราฟิก อีกทั้งยังสามารถเขียนโค้ดผ่าน Code editor ซึ่งใช้งานผ่าน Python Library ของซอฟต์แวร์ตัวกลาง Qiskit หากผู้สอนหรือผู้เรียนเกิดข้อสงสัยหรือต้องการพูดคุยแลกเปลี่ยนความคิดเห็นต่าง ๆ ที่เกี่ยวข้องกับควอนตัมคอมพิวเตอร์ ผู้ใช้งานที่ได้ทำการลงทะเบียนแล้วสามารถตั้งกระทู้และแสดงความเห็นผ่านฟีเจอร์ห้องสนทนาได้ทั้งในรูปแบบของตัวอักษรและรูปภาพ ในส่วนของผู้สอนนั้น จะมีฟีเจอร์ที่สามารถสร้างบทเรียนและแบบฝึกหัดเกี่ยวกับควอนตัมคอมพิวเตอร์ได้ โดยผู้สอนจะสามารถเพิ่มเนื้อหาบทเรียนผ่านแบบฟอร์มของทางเว็บแอปพลิเคชันได้ในรูปแบบตัวอักษรและรูปภาพเช่นเดียวกับฟีเจอร์ห้องสนทนา อีกทั้งยังสามารถสร้างแบบฝึกหัดพร้อมกับเพิ่มวิธีตรวจอัตโนมัติได้อีกด้วย ซึ่งผู้เรียนสามารถเลือกศึกษาบทเรียนต่าง ๆ ที่ผู้สอนได้ทำการเผยแพร่ตามความสนใจของตนเอง</span></p><p>&nbsp;</p><p><span style="background-color:transparent;color:#000000;">EZQ คือเว็บแอปพลิเคชันที่ถูกสร้างขึ้นโดยมีจุดมุ่งหมายเพื่อยกระดับประสบการณ์การเรียนรู้ด้านควอนตัมคอมพิวเตอร์สำหรับผู้เริ่มศึกษา ภายในเว็บแอปพลิเคชันประกอบด้วยฟีเจอร์ Code Playground ซึ่งทั้งผู้เรียนและผู้สอน รวมถึงผู้ใช้งานที่ยังไม่ได้ลงทะเบียนสามารถเข้าใช้งานและสร้างวงจรของตนเองผ่าน UI แบบกราฟิก อีกทั้งยังสามารถเขียนโค้ดผ่าน Code editor ซึ่งใช้งานผ่าน Python Library ของซอฟต์แวร์ตัวกลาง Qiskit หากผู้สอนหรือผู้เรียนเกิดข้อสงสัยหรือต้องการพูดคุยแลกเปลี่ยนความคิดเห็นต่าง ๆ ที่เกี่ยวข้องกับควอนตัมคอมพิวเตอร์ ผู้ใช้งานที่ได้ทำการลงทะเบียนแล้วสามารถตั้งกระทู้และแสดงความเห็นผ่านฟีเจอร์ห้องสนทนาได้ทั้งในรูปแบบของตัวอักษรและรูปภาพ ในส่วนของผู้สอนนั้น จะมีฟีเจอร์ที่สามารถสร้างบทเรียนและแบบฝึกหัดเกี่ยวกับควอนตัมคอมพิวเตอร์ได้ โดยผู้สอนจะสามารถเพิ่มเนื้อหาบทเรียนผ่านแบบฟอร์มของทางเว็บแอปพลิเคชันได้ในรูปแบบตัวอักษรและรูปภาพเช่นเดียวกับฟีเจอร์ห้องสนทนา อีกทั้งยังสามารถสร้างแบบฝึกหัดพร้อมกับเพิ่มวิธีตรวจอัตโนมัติได้อีกด้วย ซึ่งผู้เรียนสามารถเลือกศึกษาบทเรียนต่าง ๆ ที่ผู้สอนได้ทำการเผยแพร่ตามความสนใจของตนเอง</span></p><p>&nbsp;</p><p><span style="background-color:transparent;color:#000000;">EZQ คือเว็บแอปพลิเคชันที่ถูกสร้างขึ้นโดยมีจุดมุ่งหมายเพื่อยกระดับประสบการณ์การเรียนรู้ด้านควอนตัมคอมพิวเตอร์สำหรับผู้เริ่มศึกษา ภายในเว็บแอปพลิเคชันประกอบด้วยฟีเจอร์ Code Playground ซึ่งทั้งผู้เรียนและผู้สอน รวมถึงผู้ใช้งานที่ยังไม่ได้ลงทะเบียนสามารถเข้าใช้งานและสร้างวงจรของตนเองผ่าน UI แบบกราฟิก อีกทั้งยังสามารถเขียนโค้ดผ่าน Code editor ซึ่งใช้งานผ่าน Python Library ของซอฟต์แวร์ตัวกลาง Qiskit หากผู้สอนหรือผู้เรียนเกิดข้อสงสัยหรือต้องการพูดคุยแลกเปลี่ยนความคิดเห็นต่าง ๆ ที่เกี่ยวข้องกับควอนตัมคอมพิวเตอร์ ผู้ใช้งานที่ได้ทำการลงทะเบียนแล้วสามารถตั้งกระทู้และแสดงความเห็นผ่านฟีเจอร์ห้องสนทนาได้ทั้งในรูปแบบของตัวอักษรและรูปภาพ ในส่วนของผู้สอนนั้น จะมีฟีเจอร์ที่สามารถสร้างบทเรียนและแบบฝึกหัดเกี่ยวกับควอนตัมคอมพิวเตอร์ได้ โดยผู้สอนจะสามารถเพิ่มเนื้อหาบทเรียนผ่านแบบฟอร์มของทางเว็บแอปพลิเคชันได้ในรูปแบบตัวอักษรและรูปภาพเช่นเดียวกับฟีเจอร์ห้องสนทนา อีกทั้งยังสามารถสร้างแบบฝึกหัดพร้อมกับเพิ่มวิธีตรวจอัตโนมัติได้อีกด้วย ซึ่งผู้เรียนสามารถเลือกศึกษาบทเรียนต่าง ๆ ที่ผู้สอนได้ทำการเผยแพร่ตามความสนใจของตนเอง</span></p>',
    //     cover: {
    //       data: {
    //         id: 17,
    //         attributes: {
    //           url: "/uploads/1656253109941_be7230fd75.jpg",
    //         },
    //       },
    //     },
    //     tags: {
    //       data: [
    //         {
    //           id: 2,
    //           attributes: {
    //             name: "QuantumProgramming",
    //           },
    //         },
    //         {
    //           id: 13,
    //           attributes: {
    //             name: "QuantumIDE",
    //           },
    //         },
    //         {
    //           id: 14,
    //           attributes: {
    //             name: "EducationalProgram",
    //           },
    //         },
    //         {
    //           id: 15,
    //           attributes: {
    //             name: "LearningAndTeachingProgram",
    //           },
    //         },
    //         {
    //           id: 17,
    //           attributes: {
    //             name: "QuantumLearning",
    //           },
    //         },
    //         {
    //           id: 16,
    //           attributes: {
    //             name: "InteractiveLearning",
    //           },
    //         },
    //       ],
    //     },
    //     authors: {
    //       data: [
    //         {
    //           id: 27,
    //           attributes: {
    //             firstname: "ขัตติยา",
    //             lastname: "กีลิตวาลา",
    //           },
    //         },
    //         {
    //           id: 29,
    //           attributes: {
    //             firstname: "ภคนันท์",
    //             lastname: "รตะไพบูลย์",
    //           },
    //         },
    //         {
    //           id: 31,
    //           attributes: {
    //             firstname: "วรดา",
    //             lastname: "เจียมจิณณวัตร",
    //           },
    //         },
    //       ],
    //     },
    //   },
    // };
    const query = qs.stringify(
      {
        filters: {
          slug: {
            $eq: slug,
          },
        },
        populate: {
          cover: {
            fields: ["url"],
          },
          tags: {
            fields: ["name"],
          },
          authors: {
            fields: ["firstname", "lastname"],
          },
        },
      },
      {
        encodeValuesOnly: true,
      }
    );

    return await http
      .get("/articles?" + query)
      .then((response) => {
        return response.data.data[0];
      })
      .catch((error) => {
        console.log(error);
      });
  }
})();
